In [4]:
import sqlalchemy as db
from sqlalchemy import text
import pandas as pd

In [5]:
engine = db.create_engine("mysql://root:root@192.168.186.77:3310/retail_db")
conn = engine.connect()

In [6]:
customers_df = pd.read_sql_query(text('SELECT * FROM customers'), con=conn)
customers_df.head()

Empty DataFrame
Columns: [customer_id, customer_fname, customer_lname, customer_email, customer_password, customer_street, customer_city, customer_state, customer_zipcode]
Index: []

In [7]:
orders_df = pd.read_sql_query(text('SELECT * FROM orders'), con=conn)
orders_df.head()

   order_id             order_date  order_customer_id     order_status
0         1  2013-07-25 00:00:00.0              11599           CLOSED
1         2  2013-07-25 00:00:00.0                256  PENDING_PAYMENT
2         3  2013-07-25 00:00:00.0              12111         COMPLETE
3         4  2013-07-25 00:00:00.0               8827           CLOSED
4         5  2013-07-25 00:00:00.0              11318         COMPLETE

In [8]:
order_items_df = pd.read_sql_query(text('SELECT * FROM order_items'), con=conn)
order_items_df.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [9]:
products_df = pd.read_sql_query(text('SELECT * FROM products'), con=conn)
products_df.head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,None,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,None,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,None,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,None,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,None,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [10]:
categories_df = pd.read_sql_query(text('SELECT * FROM categories'), con=conn)
categories_df.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [11]:
departments_df = pd.read_sql_query(text('SELECT * FROM departments'), con=conn)
departments_df.head()

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors

#### Promerdio de ingresos por dia

In [12]:
df_join = orders_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id', how='left')
df_join.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99
2,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00
3,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99
4,3,2013-07-25 00:00:00.0,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN

In [13]:
df_promedio = df_join[['order_date','order_item_subtotal']].groupby('order_date').sum()["order_item_subtotal"]/df_join[['order_date',"order_item_order_id"]].drop_duplicates().groupby('order_date').count()["order_item_order_id"]
df_promedio.head(10)

order_date
2013-07-25 00:00:00.0    587.533017
2013-07-26 00:00:00.0    585.923476
2013-07-27 00:00:00.0    577.567657
2013-07-28 00:00:00.0    551.411899
2013-07-29 00:00:00.0    635.588380
2013-07-30 00:00:00.0    564.536374
2013-07-31 00:00:00.0    630.995502
2013-08-01 00:00:00.0    608.498208
2013-08-02 00:00:00.0    587.887097
2013-08-03 00:00:00.0    599.162830
dtype: float64

#### Promedio de ingresos por mes

In [14]:
df_join.dtypes

order_id                      int64
order_date                   object
order_customer_id             int64
order_status                 object
order_item_id               float64
order_item_order_id         float64
order_item_product_id       float64
order_item_quantity         float64
order_item_subtotal         float64
order_item_product_price    float64
dtype: object

In [15]:
df_join["month"]= df_join['order_date'].astype(str).str[5:7]
df_join['month'] = df_join['month'].astype('int32')
df_join.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,month
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98,7
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99,7
2,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00,7
3,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99,7
4,3,2013-07-25 00:00:00.0,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN,7

In [16]:
df_promedio = df_join[['month','order_item_subtotal']].groupby('month').sum(["order_item_subtotal"])["order_item_subtotal"]/df_join[['month',"order_item_order_id"]].drop_duplicates().groupby('month').count()["order_item_order_id"]
df_promedio

month
1     593.916939
2     594.366558
3     598.221987
4     592.235773
5     605.072136
6     612.336000
7     593.416066
8     596.889365
9     602.572335
10    591.392657
11    596.733716
12    595.767676
dtype: float64

#### Total de ingresos por año

In [17]:
df_join["year"]=df_join['order_date'].astype(str).str[0:4]
df_join['year'] = df_join['year'].astype('int32')
df_join.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,month,year
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98,7,2013
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99,7,2013
2,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00,7,2013
3,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99,7,2013
4,3,2013-07-25 00:00:00.0,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN,7,2013

In [18]:
df_total = df_join[['year','month','order_item_subtotal']].groupby(['year','month']).sum(["order_item_subtotal"])

df_total.reset_index()

    year  month  order_item_subtotal
0   2013      7            764782.19
1   2013      8           2828658.70
2   2013      9           2934527.27
3   2013     10           2624600.61
4   2013     11           3168656.03
5   2013     12           2932964.27
6   2014      1           2924447.01
7   2014      2           2778663.66
8   2014      3           2862492.21
9   2014      4           2807789.80
10  2014      5           2753078.22
11  2014      6           2703463.44
12  2014      7           2238496.52

#### Departamentos con mejores rendimientos

In [19]:
df_join  = orders_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id')\
                    .merge(products_df, left_on='order_item_product_id', right_on='product_id')\
                    .merge(categories_df, left_on='product_category_id', right_on='category_id')\
                    .merge(departments_df, left_on='category_department_id', right_on='department_id')

In [20]:
df_join.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,...,product_category_id,product_name,product_description,product_price,product_image,category_id,category_department_id,category_name,department_id,department_name
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1,1,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop
1,5,2013-07-25 00:00:00.0,11318,COMPLETE,9,5,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop
2,5,2013-07-25 00:00:00.0,11318,COMPLETE,12,5,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop
3,7,2013-07-25 00:00:00.0,4530,COMPLETE,15,7,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop
4,12,2013-07-25 00:00:00.0,1837,CLOSED,34,12,957,1,299.98,299.98,...,43,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop

In [21]:
df_dep = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum(['order_item_subtotal'])
df_dep.reset_index()

  department_name  order_item_subtotal
0         Apparel           7323700.20
1        Fan Shop          17107765.88
2         Fitness            280044.14
3        Footwear           4006498.77
4            Golf           4609028.22
5        Outdoors            995582.72

#### Departamentos con mejores rendimientos por año

In [22]:
df_join["year"]=df_join['order_date'].astype(str).str[0:4]
df_join['year'] = df_join['year'].astype('int32')
df_join.head(10)
#df_join.query("order_item_quantity > 1").head(50)

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,...,product_name,product_description,product_price,product_image,category_id,category_department_id,category_name,department_id,department_name,year
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1,1,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
1,5,2013-07-25 00:00:00.0,11318,COMPLETE,9,5,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
2,5,2013-07-25 00:00:00.0,11318,COMPLETE,12,5,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
3,7,2013-07-25 00:00:00.0,4530,COMPLETE,15,7,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
4,12,2013-07-25 00:00:00.0,1837,CLOSED,34,12,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
5,19,2013-07-25 00:00:00.0,9488,PENDING_PAYMENT,59,19,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
6,23,2013-07-25 00:00:00.0,4367,PENDING_PAYMENT,68,23,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
7,28,2013-07-25 00:00:00.0,656,COMPLETE,79,28,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
8,28,2013-07-25 00:00:00.0,656,COMPLETE,80,28,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013
9,34,2013-07-25 00:00:00.0,4189,PROCESSING,94,34,957,1,299.98,299.98,...,Diamondback Women's Serene Classic Comfort Bi,None,299.98,http://images.acmesports.sports/Diamondback+Wo...,43,7,Camping & Hiking,7,Fan Shop,2013

In [23]:
df_dep = df_join[['year','department_name','order_item_subtotal']].groupby(['year','department_name']).sum(['order_item_subtotal'])
df_dep.reset_index()

    year department_name  order_item_subtotal
0   2013         Apparel           3228557.53
1   2013        Fan Shop           7615003.64
2   2013         Fitness            123587.89
3   2013        Footwear           1789823.74
4   2013            Golf           2058230.89
5   2013        Outdoors            438985.38
6   2014         Apparel           4095142.67
7   2014        Fan Shop           9492762.24
8   2014         Fitness            156456.25
9   2014        Footwear           2216675.03
10  2014            Golf           2550797.33
11  2014        Outdoors            556597.34

#### Categorias mas populares

In [24]:
df_join  = orders_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id')\
                    .merge(products_df, left_on='order_item_product_id', right_on='product_id')\
                    .merge(categories_df, left_on='product_category_id', right_on='category_id')

df_join['count'] = 1

In [25]:
df_cat = df_join[["category_name",'count']].groupby('category_name').count()
df_cat.sort_values('count',ascending=False).head(10).reset_index()

          category_name  count
0                Cleats  24551
1        Men's Footwear  22246
2       Women's Apparel  21035
3  Indoor/Outdoor Games  19298
4               Fishing  17325
5          Water Sports  15540
6      Camping & Hiking  13729
7      Cardio Equipment  12487
8         Shop By Sport  10984
9           Electronics   3156

In [26]:
df_cat = df_join[["category_name",'order_item_quantity']].groupby('category_name').sum(["order_item_quantity"])
df_cat.sort_values('order_item_quantity',ascending=False).head(10).reset_index()

          category_name  order_item_quantity
0                Cleats                73734
1       Women's Apparel                62956
2  Indoor/Outdoor Games                57803
3      Cardio Equipment                37587
4         Shop By Sport                32726
5        Men's Footwear                22246
6               Fishing                17325
7          Water Sports                15540
8      Camping & Hiking                13729
9           Electronics                 9436

#### Numero de ordenes por status

In [27]:
orders_df['count'] = 1
df_ord = orders_df[["order_status","count"]].groupby('order_status').count()
df_ord.reset_index()

      order_status  count
0         CANCELED   1428
1           CLOSED   7556
2         COMPLETE  22899
3          ON_HOLD   3798
4   PAYMENT_REVIEW    729
5          PENDING   7610
6  PENDING_PAYMENT  15030
7       PROCESSING   8275
8  SUSPECTED_FRAUD   1558

#### Obtener número de ordenes por fecha de pedido y estado del pedido

In [28]:
df_ped_st = orders_df[['order_date','order_status','count']].groupby(['order_date','order_status']).count()
df_ped_st.head(10).reset_index()

              order_date     order_status  count
0  2013-07-25 00:00:00.0         CANCELED      1
1  2013-07-25 00:00:00.0           CLOSED     20
2  2013-07-25 00:00:00.0         COMPLETE     42
3  2013-07-25 00:00:00.0          ON_HOLD      5
4  2013-07-25 00:00:00.0   PAYMENT_REVIEW      3
5  2013-07-25 00:00:00.0          PENDING     13
6  2013-07-25 00:00:00.0  PENDING_PAYMENT     41
7  2013-07-25 00:00:00.0       PROCESSING     16
8  2013-07-25 00:00:00.0  SUSPECTED_FRAUD      2
9  2013-07-26 00:00:00.0         CANCELED      3

#### Obtener todos los pedidos CANCELADOS con un monto superior a $ 1000

In [29]:
df_join = orders_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id')

df_join.head()

,order_id,order_date,order_customer_id,order_status,count,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,2013-07-25 00:00:00.0,11599,CLOSED,1,1,1,957,1,299.98,299.98
1,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,1,2,2,1073,1,199.99,199.99
2,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,1,3,2,502,5,250.00,50.00
3,2,2013-07-25 00:00:00.0,256,PENDING_PAYMENT,1,4,2,403,1,129.99,129.99
4,4,2013-07-25 00:00:00.0,8827,CLOSED,1,5,4,897,2,49.98,24.99

In [30]:
df_join[['order_id', 'order_date', 'order_status', 'order_item_subtotal']].query("order_status == 'CANCELED'")\
    .groupby(['order_id', 'order_date', 'order_status']).sum(["order_item_subtotal"])\
    .query("order_item_subtotal > 1000").reset_index()

     order_id             order_date order_status  order_item_subtotal
0         753  2013-07-29 00:00:00.0     CANCELED              1129.75
1        2012  2013-08-04 00:00:00.0     CANCELED              1499.86
2        2144  2013-08-05 00:00:00.0     CANCELED              1099.90
3        2189  2013-08-06 00:00:00.0     CANCELED              1029.94
4        2271  2013-08-06 00:00:00.0     CANCELED              1229.93
..        ...                    ...          ...                  ...
134     67334  2014-07-22 00:00:00.0     CANCELED              1199.91
135     67608  2013-09-11 00:00:00.0     CANCELED              1079.92
136     67746  2013-10-27 00:00:00.0     CANCELED              1099.93
137     68059  2014-01-25 00:00:00.0     CANCELED              1149.83
138     68816  2014-03-26 00:00:00.0     CANCELED              2329.94

[139 rows x 4 columns]

#### Obtenga los 5 mejores productos en cada categoría donde los productos están ordenados por precio más alto a más bajo

In [31]:
df_ = products_df.copy()

In [32]:
df_['dense_rank'] = (df_.groupby('product_category_id')['product_price']
                      .rank(method='dense', ascending=0,)
                      .astype(int)
                     )

In [33]:
df_top_5_by_category = (df_[['product_category_id','product_name', 'product_price', 'dense_rank']]
                            .sort_values(['product_category_id','dense_rank']))
df_top_5_by_category.groupby('product_category_id').head(5).reset_index(drop=True)

,product_category_id,product_name,product_price,dense_rank
0,2,Riddell Youth 360 Custom Football Helmet,299.99,1
1,2,Fitness Gear 300 lb Olympic Weight Set,209.99,2
2,2,Riddell Youth Revolution Speed Custom Footbal,199.99,3
3,2,Quik Shade Summit SX170 10 FT. x 10 FT. Canop,199.99,3
4,2,Under Armour Men's Highlight MC Alter Ego Fla,139.99,4
...,...,...,...,...
270,59,Nike Men's Home Game Jersey Cleveland Browns,100.00,1
271,59,Nike Men's Home Game Jersey Denver Broncos Pe,100.00,1
272,59,Nike Men's Home Game Jersey Buffalo Bills Sam,100.00,1
273,59,Nike Men's Home Game Jersey San Francisco 49e,100.00,1
274,59,Nike Men's Home Game Jersey Pittsburgh Steele,100.00,1